<template>
  <div>
    <ve-line :data="chartData" :settings="time"></ve-line>
    <ve-histogram :data="chartData2"></ve-histogram>
  </div>
</template>

<script>
    export default {
        data() {
            return {
                chartData: {
                    columns: ['日期', '用例执行数', '成功数', '失败数'],
                    rows: [
                        {'日期': '2018-01-01', '用例执行数': 1393, '成功数': 1093, '失败数': 300},
                        {'日期': '2018-01-02', '用例执行数': 3530, '成功数': 3230, '失败数': 300},
                        {'日期': '2018-01-03', '用例执行数': 2923, '成功数': 2623, '失败数': 300},
                        {'日期': '2018-01-05', '用例执行数': 1723, '成功数': 1423, '失败数': 300},
                        {'日期': '2018-01-10', '用例执行数': 3792, '成功数': 3492, '失败数': 300},
                        {'日期': '2018-01-20', '用例执行数': 4593, '成功数': 4293, '失败数': 300}
                    ]
                },
                chartData2: {
                    columns: ['日期', '用例执行数', '失败数'],
                    rows: [
                        { '日期': '2018-01-01', '用例执行数': 1393, '失败数': 1093},
                        { '日期': '2018-01-01', '用例执行数': 3530, '失败数': 3230},
                        { '日期': '2018-01-01', '用例执行数': 2923, '失败数': 2623},
                        { '日期': '2018-01-01', '用例执行数': 1723, '失败数': 1423},
                        { '日期': '2018-01-01', '用例执行数': 3792, '失败数': 3492},
                        { '日期': '2018-01-01', '用例执行数': 4593, '失败数': 4293}
                    ]
                }
            }
        }
    }
</script>
